---
type: SaveAsOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# SaveAsOptions

`Autodesk.Revit.DB.SaveAsOptions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SaveAsOptions | 2012 | `public SaveAsOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetWorksharingOptions | 2014 | `public WorksharingSaveAsOptions GetWorksharingOptions ()` |
| Method | SetWorksharingOptions | 2014 | `public void SetWorksharingOptions ( WorksharingSaveAsOptions worksharingOptions )` |
| Property | Compact | 2014 | `public bool Compact { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaximumBackups | 2014 | `public int MaximumBackups { get ; set ; }` |
| Property | OverwriteExistingFile | 2012 | `public bool OverwriteExistingFile { get ; set ; }` |
| Property | PreviewViewId | 2012 | `public ElementId PreviewViewId { get ; set ; }` |